app/controllers/posts_controller.rb

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 4]]
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = 8
SELECT "authors".* FROM "authors"
SELECT "posts".* FROM "posts" WHERE (created_at >='2016-01-27 00:00:00.000000')
---
  def index
    if params[:author_id]
      @posts = Author.find_by(id: params[:author_id]).posts
    else
      @posts = Post.all

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."author_id" = ? AND "posts"."id" = ? LIMIT 1  [["author_id", 1], ["id", 1]]
---
  def show
    if params[:author_id]
      @post = Author.find(params[:author_id]).posts.find(params[:id])

SELECT  1 AS one FROM "authors" LIMIT 1
SELECT "authors".* FROM "authors"
---
  def new
    if params[:author_id] && !Author.exists?(params[:author_id])

INSERT INTO "posts" ("title", "description", "created_at", "updated_at", "author_id") VALUES (?, ?, ?, ?, ?)  [["title", "Aragon"], ["description", "Dragons on the loose \r\n"], ["created_at", "2021-01-26 01:52:10.714704"], ["updated_at", "2021-01-26 01:52:10.714704"], ["author_id", 4]]
---
  def create
    @post = Post.new(post_params)
    @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "My Edit"], ["description", "My post description"], ["updated_at", "2016-01-27 20:09:01.104499"], ["id", 1]]
---
  def update
    @post = Post.find(params[:id])
    @post.update(post_params)

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 123456]]
SELECT  "posts".* FROM "posts" WHERE "posts"."author_id" = ? AND "posts"."id" = ? LIMIT 1  [["author_id", 1], ["id", 1]]
---
  def edit
    if params[:author_id]
      author = Author.find_by(id: params[:author_id])
      if author.nil?
        redirect_to authors_path, alert: "Author not found."
      else
        @post = author.posts.find_by(id: params[:id])